Repository: qubasehq/Qmcp
Catalog: lib/l10n/app_*.arb
Languages: te

source: Settings
te: సెట్టింగ్స్

source: General
te: సాధారణం

source: Providers
te: ప్రొవైడర్లు

source: MCP Server
te: MCP సర్వర్

source: Language
te: భాష

source: Theme
te: థీమ్

source: Dark
te: డార్క్

source: Light
te: లైట్

source: System
te: సిస్టమ్

source: Language Settings
te: భాషా సెట్టింగ్స్

source: Feature Settings
te: ఫీచర్ సెట్టింగ్స్

source: Enable Artifacts
te: ఆర్టిఫాక్ట్స్ ఎనేబుల్ చేయండి

# enableArtifactsDescription
source: Enable the artifacts of the AI assistant in the conversation, will use more tokens
te: AI అసిస్టెంట్ యొక్క ఆర్టిఫాక్ట్స్‌ని సంభాషణలో ఎనేబుల్ చేయండి, ఎక్కువ టోకెన్లు ఉపయోగించబడతాయి

source: Enable Tool Usage
te: టూల్ వాడకం ఎనేబుల్ చేయండి

# enableToolUsageDescription
source: Enable the usage of tools in the conversation, will use more tokens
te: సంభాషణలో టూల్స్ వాడకాన్ని ఎనేబుల్ చేయండి, ఎక్కువ టోకెన్లు ఉపయోగించబడతాయి

source: Theme Settings
te: థీమ్ సెట్టింగ్స్

source: Light Theme
te: లైట్ థీమ్

source: Dark Theme
te: డార్క్ థీమ్

source: Follow System
te: సిస్టమ్‌ని అనుసరించు

source: Show Avatar
te: అవతార్‌ని చూపించు

source: Show Assistant Avatar
te: అసిస్టెంట్ అవతార్‌ని చూపించు

# showAssistantAvatarDescription
source: Show the avatar of the AI assistant in the conversation
te: సంభాషణలో AI అసిస్టెంట్ యొక్క అవతార్‌ని చూపించు

source: Show User Avatar
te: యూజర్ అవతార్‌ని చూపించు

# showUserAvatarDescription
source: Show the avatar of the user in the conversation
te: సంభాషణలో యూజర్ యొక్క అవతార్‌ని చూపించు

source: System Prompt
te: సిస్టమ్ ప్రాంప్ట్

# systemPromptDescription
source: This is the system prompt for the conversation with the AI assistant, used to set the behavior and style of the assistant
te: ఇది AI అసిస్టెంట్‌తో సంభాషణ కోసం సిస్టమ్ ప్రాంప్ట్, అసిస్టెంట్ ప్రవర్తన మరియు శైలిని సెట్ చేయడానికి ఉపయోగించబడుతుంది

source: LLM Key
te: LLM కీ

source: Tool Key
te: టూల్ కీ

source: Save Settings
te: సెట్టింగ్స్ సేవ్ చేయండి

source: API Key
te: API కీ

# enterApiKey
source: Enter your {provider} API Key
te: మీ {provider} API కీని ఎంటర్ చేయండి

# apiKeyValidation
source: API Key must be at least 10 characters
te: API కీ కనీసం 10 అక్షరాలు ఉండాలి

source: API Endpoint
te: API ఎండ్‌పాయింట్

# enterApiEndpoint
source: Enter API endpoint URL
te: API ఎండ్‌పాయింట్ URL ఎంటర్ చేయండి

# platformNotSupported
source: Current platform does not support MCP Server
te: ప్రస్తుత ప్లాట్‌ఫారమ్ MCP సర్వర్‌ని సపోర్ట్ చేయదు

# mcpServerDesktopOnly
source: MCP Server only supports desktop platforms (Windows, macOS, Linux)
te: MCP సర్వర్ డెస్క్‌టాప్ ప్లాట్‌ఫారమ్‌లను (Windows, macOS, Linux) మాత్రమే సపోర్ట్ చేస్తుంది

source: Search server...
te: సర్వర్‌ని వెతకండి...

# noServerConfigs
source: No server configurations found
te: సర్వర్ కాన్ఫిగరేషన్లు కనుగొనబడలేదు

source: Refresh
te: రిఫ్రెష్

source: Install
te: ఇన్‌స్టాల్

source: Edit
te: ఎడిట్

source: Delete
te: డిలీట్

source: Command
te: కమాండ్

source: Arguments
te: ఆర్గ్యుమెంట్స్

source: Environment Variables
te: ఎన్విరాన్మెంట్ వేరియబుల్స్

source: Server Name
te: సర్వర్ పేరు

# commandExample
source: For example: npx, uvx
te: ఉదాహరణకు: npx, uvx

# argumentsExample
source: Separate arguments with spaces, for example: -m mcp.server
te: స్పేస్‌లతో ఆర్గ్యుమెంట్లను వేరు చేయండి, ఉదాహరణకు: -m mcp.server

# envVarsFormat
source: One per line, format: KEY=VALUE
te: ప్రతి లైన్‌కు ఒకటి, ఫార్మాట్: KEY=VALUE

source: Cancel
te: రద్దు

source: Save
te: సేవ్

source: Confirm Delete
te: తొలగింపును నిర్ధారించండి

# confirmDeleteServer
source: Are you sure you want to delete server "{name}" ?
te: మీరు నిజంగా సర్వర్ "{name}"ని తొలగించాలనుకుంటున్నారా?

source: Error
te: ఎర్రర్

# commandNotExist
source: Command "{command}" does not exist, please install it first Current PATH: {path}
te: కమాండ్ "{command}" ఉనికిలో లేదు, దయచేసి మొదట దీన్ని ఇన్‌స్టాల్ చేయండి ప్రస్తుత PATH: {path}

source: All
te: అన్నీ

source: Installed
te: ఇన్‌స్టాల్ చేయబడింది

source: Model Settings
te: మోడల్ సెట్టింగ్స్

# temperature
source: Temperature: {value}
te: టెంపరేచర్: {value}

# temperatureTooltip
source: Sampling temperature controls the randomness of output: • 0.0: Suitable for code generation and math problems • 1.0: Suitable for data extraction and analysis • 1.3: Suitable for general conversation and translation • 1.5: Suitable for creative writing and poetry
te: శాంప్లింగ్ టెంపరేచర్ అవుట్‌పుట్ యాదృచ్ఛికతను నియంత్రిస్తుంది: • 0.0: కోడ్ జనరేషన్ మరియు గణిత సమస్యలకు సరైనది • 1.0: డేటా ఎక్స్‌ట్రాక్షన్ మరియు విశ్లేషణకు సరైనది • 1.3: సాధారణ సంభాషణ మరియు అనువాదానికి సరైనది • 1.5: సృజనాత్మక రచన మరియు కవిత్వానికి సరైనది

# topP
source: Top P: {value}
te: టాప్ P: {value}

# topPTooltip
source: Top P (nucleus sampling) is an alternative to temperature. The model only considers tokens whose cumulative probability exceeds P. It is recommended not to modify both temperature and top_p at the same time.
te: టాప్ P (న్యూక్లియస్ శాంప్లింగ్) టెంపరేచర్‌కు ప్రత్యామ్నాయం. మోడల్ సంచిత సంభావ్యత P ని మించే టోకెన్‌లను మాత్రమే పరిగణిస్తుంది. ఒకేసారి టెంపరేచర్ మరియు top_p రెండింటినీ సవరించడం సిఫార్సు చేయబడదు.

source: Max Tokens
te: గరిష్ట టోకెన్లు

# maxTokensTooltip
source: Maximum number of tokens to generate. One token is approximately equal to 4 characters. Longer conversations require more tokens.
te: జనరేట్ చేయాల్సిన గరిష్ట టోకెన్ల సంఖ్య. ఒక టోకెన్ సుమారు 4 అక్షరాలకు సమానం. పొడవైన సంభాషణలకు మరిన్ని టోకెన్లు అవసరం.

# frequencyPenalty
source: Frequency Penalty: {value}
te: ఫ్రీక్వెన్సీ పెనాల్టీ: {value}

# frequencyPenaltyTooltip
source: Frequency penalty parameter. Positive values penalize new tokens based on their existing frequency in the text, decreasing the model's likelihood of repeating the same content verbatim.
te: ఫ్రీక్వెన్సీ పెనాల్టీ పారామీటర్. సానుకూల విలువలు టెక్స్ట్‌లో ఉన్న వాటి ఫ్రీక్వెన్సీ ఆధారంగా కొత్త టోకెన్‌లను పెనాల్టీ చేస్తాయి, అదే కంటెంట్‌ని యథాతథంగా పునరావృతం చేసే మోడల్ సంభావ్యతను తగ్గిస్తాయి.

# presencePenalty
source: Presence Penalty: {value}
te: ప్రెజెన్స్ పెనాల్టీ: {value}

# presencePenaltyTooltip
source: Presence penalty parameter. Positive values penalize new tokens based on whether they appear in the text, increasing the model's likelihood of talking about new topics.
te: ప్రెజెన్స్ పెనాల్టీ పారామీటర్. సానుకూల విలువలు టెక్స్ట్‌లో కనిపించే ఆధారంగా కొత్త టోకెన్‌లను పెనాల్టీ చేస్తాయి, కొత్త అంశాల గురించి మాట్లాడే మోడల్ సంభావ్యతను పెంచుతాయి.

source: Enter max tokens
te: గరిష్ట టోకెన్లను ఎంటర్ చేయండి

source: Share
te: షేర్

source: Model Config
te: మోడల్ కాన్ఫిగ్

source: Debug
te: డీబగ్

source: Web Search Test
te: వెబ్ సెర్చ్ టెస్ట్

source: Today
te: నేడు

source: Yesterday
te: నిన్న

source: Last 7 Days
te: గత 7 రోజులు

source: Last 30 Days
te: గత 30 రోజులు

source: Earlier
te: మునుపటి

# confirmDeleteSelected
source: Are you sure you want to delete the selected conversations?
te: ఎంచుకున్న సంభాషణలను తొలగించాలని నిజంగా అనుకుంటున్నారా?

source: OK
te: సరే

source: Ask me anything...
te: ఏదైనా అడగండి...

source: Upload Files
te: ఫైల్స్ అప్‌లోడ్ చేయండి

# welcomeMessage
source: How can I help you today?
te: నేను మీకు ఎలా సహాయపడగలను?

source: Copy
te: కాపీ

# copied
source: Copied to clipboard
te: క్లిప్‌బోర్డ్‌కి కాపీ చేయబడింది

source: Retry
te: మళ్ళీ ప్రయత్నించండి

source: Broken Image
te: చెడిపోయిన చిత్రం

source: Select Model
te: మోడల్‌ని ఎంచుకోండి

source: Close
te: మూసివేయి

source: Select from Gallery
te: గ్యాలరీ నుండి ఎంచుకోండి

source: Select File
te: ఫైల్‌ని ఎంచుకోండి

source: Upload File
te: ఫైల్ అప్‌లోడ్

source: Open Browser
te: బ్రౌజర్ తెరవండి

source: Code copied to clipboard
te: కోడ్ క్లిప్‌బోర్డ్‌కి కాపీ చేయబడింది

source: Thinking
te: ఆలోచిస్తోంది

source: Thinking End
te: ఆలోచన ముగిసింది

source: Tool
te: టూల్

# userCancelledToolCall
source: Tool execution failed
te: టూల్ ఎక్సిక్యూషన్ విఫలమైంది

source: Code
te: కోడ్

source: Preview
te: ప్రివ్యూ

# loadContentFailed
source: Failed to load content, please retry
te: కంటెంట్ లోడ్ చేయడం విఫలమైంది, దయచేసి మళ్ళీ ప్రయత్నించండి

source: Opening browser
te: బ్రౌజర్ తెరుస్తోంది

# functionCallAuth
source: Tool Call Authorization
te: టూల్ కాల్ ఆథరైజేషన్

# allowFunctionExecution
source: Do you want to allow the following tool to execute:
te: క్రింది టూల్‌ని ఎక్సిక్యూట్ చేయడానికి అనుమతించాలనుకుంటున్నారా:

# parameters
source: Parameters: {params}
te: పారామీటర్లు: {params}

source: Allow
te: అనుమతించు

# loadDiagramFailed
source: Failed to load diagram, please retry
te: డయాగ్రామ్ లోడ్ చేయడం విఫలమైంది, దయచేసి మళ్ళీ ప్రయత్నించండి

source: Copied to clipboard
te: క్లిప్‌బోర్డ్‌కి కాపీ చేయబడింది

source: Chinese
te: చైనీస్

# functionRunning
source: Running Tool...
te: టూల్ రన్ అవుతోంది...

# thinkingProcess
source: Thinking
te: ఆలోచిస్తోంది

# thinkingProcessWithDuration
source: Thinking, time used
te: ఆలోచిస్తోంది, ఉపయోగించిన సమయం

# thinkingEndWithDuration
source: Thinking finished, time used
te: ఆలోచన ముగిసింది, ఉపయోగించిన సమయం

# thinkingEndComplete
source: Thinking finished
te: ఆలోచన ముగిసింది

# seconds
source: {seconds}s
te: {seconds}సె

# fieldRequired
source: This field is required
te: ఈ ఫీల్డ్ అవసరం

source: Auto Approve
te: ఆటో అప్రూవ్

# verify
source: Verify Key
te: కీని వెరిఫై చేయండి

source: How to get
te: ఎలా పొందాలి

source: Model List
te: మోడల్ జాబితా

source: Enable Models
te: మోడల్స్ ఎనేబుల్ చేయండి

source: Disable All Models
te: అన్ని మోడల్స్ డిసేబుల్ చేయండి

# saveSuccess
source: Settings saved successfully
te: సెట్టింగ్స్ విజయవంతంగా సేవ్ చేయబడ్డాయి
